app/controllers/friends_controller.rb

UPDATE "friends" SET "last_name" = ?, "email" = ?, "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["last_name", "Lopez"], ["email", "alejandro@gmail.com"], ["phone", "111 222 3333"], ["twitter", "@alejandro"], ["updated_at", "2022-05-18 20:25:22.927011"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)